[
  {
    "id": 1,
    "question": "What is NIE and why do I need it?",
    "shortAnswer": "The NIE is a foreigner's identification number required for property purchases in Spain.",
    "longAnswer": "The NIE (Número de Identificación de Extranjero) is a foreigner's identification number in Spain. It is required for any property purchase, opening a bank account, paying taxes, and other official transactions.",
    "category": "Legal"
  },
  {
    "id": 2,
    "question": "How long does it take to get an NIE?",
    "shortAnswer": "Usually a few days to weeks depending on local police station availability.",
    "longAnswer": "The process usually takes a few days to a few weeks depending on the local police station's availability. Applying early is recommended to avoid delays in the property purchase process.",
    "category": "Legal"
  },
  {
    "id": 3,
    "question": "Do I need a lawyer when buying property in Spain?",
    "shortAnswer": "While not legally required, hiring a lawyer is highly recommended.",
    "longAnswer": "While not legally required, hiring a lawyer is highly recommended. A lawyer ensures contracts are correct, verifies property ownership, checks for debts, and protects your interests during the transaction.",
    "category": "Legal"
  },
  {
    "id": 4,
    "question": "Can non-EU residents buy property in Spain?",
    "shortAnswer": "Yes, foreigners can legally buy property in Spain without restrictions.",
    "longAnswer": "Yes, foreigners can legally buy property in Spain without restrictions. You will, however, need an NIE number, a Spanish bank account, and must comply with tax obligations.",
    "category": "Legal"
  },
  {
    "id": 5,
    "question": "What is the Golden Visa program?",
    "shortAnswer": "Investment program allowing residency for €500,000+ property purchases.",
    "longAnswer": "The Golden Visa program allows non-EU investors who purchase property worth €500,000 or more to gain residency rights in Spain. It also extends to their immediate family members.",
    "category": "Visas/Residency"
  }
]